TEMP/InformationRegisters/COV_ПрохождениеВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>COV_ПрохождениеВакцинацииОтCOVID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компонент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрививки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВакцины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.COV_ВидыВакцинации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВакцинации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

TEMP/CommonModules/COV_ОбщегоНазначения/Ext/Module.bsl
Функция ОпределитьНомерПрививки(Сотрудник, Дата, Компонент) Экспорт 
	Если Компонент = 0 Тогда 
		Сообщить("ОШИБКА: В функцию ""ОпределитьНомерПрививки"" передан нулевой номер компоненты вакцины");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаВакцинации", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины.КоличествоКомпонентов = 1
	|				ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Номер
	|ИЗ
	|	РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|	И COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации < &ДатаВакцинации
	|
	|СГРУППИРОВАТЬ ПО
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() = 0 Тогда 
		Возврат 1 + Компонент/10;
	Иначе 
		Результат.Следующий();
		Возврат 1 + Цел(Результат.Номер / 2) + Компонент/10;
	КонецЕсли;
	
КонецФункции
// Параметры:
// ПараметрыВакцинации - структура с полем Ключ - "Сотрудники" Значение - массив строк табличной части Сотрудники
Процедура РассчитатьНомераПрививок(ПараметрыВакцинации) Экспорт 
	Если ТипЗнч(ПараметрыВакцинации) <> Тип("Структура") 
		Или Не ПараметрыВакцинации.Свойство("Сотрудники")
		Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из ПараметрыВакцинации.Сотрудники Цикл 
		СтрокаТЧ.НомерПрививки = ОпределитьНомерПрививки(СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВакцинации, СтрокаТЧ.КомпонентВакцины);
	КонецЦикла;
КонецПроцедуры
